#!/bin/bash

##############################################################################
# 脚本名称：build.sh
# 脚本功能：自动查找依赖库路径 --> 配置PKG_CONFIG_PATH --> 编译项目
# 适用场景：龙芯2K300/301平台，依赖 ncnn 和 OpenCV 的项目编译
# 注意事项：需确保 LQ_Dep_libs 下存在 ncnn_install/opencv_install 目录
# 注意事项：尽量避免修改原有的文件夹结构和名称, 以免脚本无法正常运行
# 使用说明：
#       1. 仅编译：./build.sh
#       2. 编译 + 传输到开发板：./build.sh 192.168.1.100(写入开发板IP)
#       3. 编译 + 传输到开发板 + 运行：./build.sh 192.168.1.100 -r
##############################################################################

# ============================================================== 基础配置（可根据实际情况修改）============================================================== #

# 依赖库配置
TARGET_DIR="LQ_Dep_libs"            # 目标依赖库根目录名称

DEP_LIBS="opencv_install ncnn_install ffmpeg_install"   # 配置需要检测的依赖库列表
# 各库pkg-config检测名
PKG_CONFIG_NAMES="\
    opencv4 \
    ncnn \
    libavformat \
    libavcodec \
    libavdevice \
    libavutil \
"

# 路径配置
SCRIPT_DIR="$(cd "$(dirname "$0")" && pwd)"     # 当前脚本所在目录
PARENT_DIR="$(cd "${SCRIPT_DIR}/../" && pwd)"   # 压缩包/文件夹的目录路径（main 同级目录）

TOOLS_DIR="${PARENT_DIR}/tools"     # tools 目录路径（main 同级目录）
BUILD_DIR="build"                   # 构建目录名称
EXECUTABLE_NAME="main"              # 可执行程序名（根据实际情况修改）

# ====================================================================== 加载子脚本 ====================================================================== #
SCRIPTS_DIR="${SCRIPT_DIR}/scripts"             # 子脚本目录路径（scripts 目录）
source "${SCRIPTS_DIR}/utils.sh"                # 通用工具函数
source "${SCRIPTS_DIR}/deps_check.sh"           # 依赖检查和安装
source "${SCRIPTS_DIR}/toolchain_setup.sh"      # 交叉编译工具链配置
source "${SCRIPTS_DIR}/deps_process.sh"         # 依赖库处理和配置PKG_CONFIG_PATH
source "${SCRIPTS_DIR}/build_project.sh"        # 编译项目
source "${SCRIPTS_DIR}/board_operations.sh"     # 开发板传输脚本

# ===================================================================== 核心函数定义 ===================================================================== #

##################################################
# 函数作用：打印关键路径
# 参数说明：无
# 使用说明：内部使用，不用管
##################################################
function print_critical_path() {
    # 打印关键路径
    log_info "================================================================= 调试信息：关键路径 ================================================================="
    log_info "脚本所在目录 ---> SCRIPT_DIR：${SCRIPT_DIR}"
    log_info "上级所在目录 ---> PARENT_DIR：${PARENT_DIR}"
    log_info "工具所在目录 ---> TOOLS_DIR ：${TOOLS_DIR}"
    log_info "依赖库所在目录 -> TARGET_DIR：${TARGET_DIR}"
    log_info "依赖库完整路径 -> target_dir_full：${TOOLS_DIR}/${TARGET_DIR}"
    log_info "依赖库的列表 ---> DEP_LIBS  ：${DEP_LIBS}"
    log_info "======================================================================================================================================================\n"
}

##################################################
# 函数作用：切换工作目录并检查 tools 目录是否存在
# 参数说明：无
# 使用说明：内部使用，不用管
##################################################
function chdir_check_tool_dir() {
    cd "${SCRIPT_DIR}"
    log_info "🔧 脚本开始执行，当前工作目录：$(pwd)\n"

    # 先检查 tools 目录是否存在
    if [ ! -d "${TOOLS_DIR}" ]; then
        log_error "❌ tools 目录不存在！预期路经：${TOOLS_DIR}，请确认目录结构！"
    fi
}

# =================================================================== 主函数定义与运行 =================================================================== #

##################################################
# 函数作用：主函数
# 参数说明：
#       $1 : 开发板 IP 地址（可选）
#       $2 : 是否运行程序（可选）
# 使用说明：内部使用，不用管
##################################################
function main() {
    local exe_path
    #================================ 解析传入参数 ================================#
    parse_incoming_params $1 $2
    #==================== 该指令表示任意指令执行失败，立即终止脚本 =====================#
    set -e
    #================================ 打印关键路径 ================================#
    print_critical_path
    #===================== 切换工作目录并检查 tools 目录是否存在 =====================#
    chdir_check_tool_dir
    #=============================== 检查并安装依赖库 ==============================#
    check_and_install_deps
    #============================== 处理交叉编译工具链 =============================#
    deal_cross_toolchain ${TOOLS_DIR}
    #========================== 生成 CMake 可识别的宏文件 ==========================#
    gen_cmake_macro_file
    #============================== 处理常驻依赖库目录 =============================#
    handle_resident_lib_dir ${TOOLS_DIR} ${TARGET_DIR}
    #=============================== 遍历所有依赖库 ===============================#
    traverse_process_dep_libs "${DEP_LIBS}"
    #=========================== 配置 PKG_CONFIG_PATH ===========================#
    setup_pkgconfig_path "${DEP_LIBS}" "${PKG_CONFIG_NAMES}"
    #================================== 编译项目 =================================#
    compile_project ${BUILD_DIR}
    #============================== SCP 传输到开发板 ==============================#
    scp_transfer_dev_board $1 ${BUILD_DIR} ${EXECUTABLE_NAME}
    #================================ 脚本执行完成 ================================#
    log_info "🎉 脚本执行完成！"
    log_info "🔍 可执行程序路径：$(pwd)/${BUILD_DIR}/${EXECUTABLE_NAME}"
    exit 0
}

# 执行主函数
main $1 $2
