#ifndef __LQ_DISPLAY_TYPES_HPP
#define __LQ_DISPLAY_TYPES_HPP

#include <stdint.h>

/****************************************************************************************************
 * @brief   枚举定义
 ****************************************************************************************************/

/* 颜色数据 */
typedef enum lq_display_color
{
    U16RED    = 0xF800,     // 红色
    U16GREEN  = 0x07E0,     // 绿色
    U16BLUE   = 0x001F,     // 蓝色
    U16PURPLE = 0xF81F,     // 紫色
    U16YELLOW = 0xFFE0,     // 黄色
    U16CYAN   = 0x07FF,     // 蓝绿色
    U16ORANGE = 0xFC08,     // 橙色
    U16BLACK  = 0x0000,     // 黑色
    U16WHITE  = 0xFFFF,     // 白色
} lq_display_color_t;

/****************************************************************************************************
 * @brief   结构体定义
 ****************************************************************************************************/

/* 屏幕结构体 */
typedef struct spi_display
{
    uint16_t  width;    // 屏幕尺寸(宽)
    uint16_t  height;   // 屏幕尺寸(高)
    uint16_t *fb;       // 映射空间
    int       fd;       // 文件描述符
} spi_display_t;

#endif
