#include "lq_all_demo.hpp"
#include "lq_display_ips20.hpp"

/********************************************************************************
 * @file    lq_ips20_demo.cpp
 * @brief   IPS20 测试.
 * @author  龙邱科技-006
 * @date    2026-01-10
 * @version V2.1.0
 * @note    适用与龙芯 2K0300/0301 平台.
 *          本 demo 实现 IPS20 功能，用于测试 IPS20 控制器的基本功能.
 ********************************************************************************/

/********************************************************************************
 * @brief   IPS20 测试.
 * @param   none.
 * @return  none.
 * @note    该程序会初始化 IPS 屏幕，然后填充黄色区域，绘制红色线，绘制黑色圆.
 ********************************************************************************/
void lq_ips20_demo()
{
    lq_ips20_drv_init(1);
    lq_ips20_drv_fill_area(10, 20, 30, 40, U16YELLOW);
    lq_ips20_drv_draw_line(10, 20, 30, 40, U16RED);
    lq_ips20_drv_draw_circle(50, 50, 30, U16BLACK);
}