#!/bin/bash

#================================================================================
# 想要自动安装新的依赖，可以在 check_and_install_deps 中添加
#================================================================================

##################################################
# 函数作用：检测并安装依赖库
# 参数说明：
#       $1 : 任意数量的依赖目录
# 使用说明：内部使用，不用管，想要添加依赖库直接在
#         REQUIRED_DEPS 变量中添加即可
##################################################
function check_and_install_dep() {
    local missing_deps=()   # 存储未找到的依赖库
    local dep_list=("$@")   # 依赖库列表
    # 逐个检测依赖，收集缺失项
    log_info "=================================================================== 检测各依赖工具 ==================================================================="
    log_info "🔍 开始检测依赖（共${#dep_list[@]}个）"
    for dep in "${dep_list[@]}"; do
        if command -v "${dep}" &>/dev/null; then
            log_info "✅ 已安装 ${dep}    \t版本可输入 ${dep} --version 验证版本号"
        else
            log_warn "⚠️ 未安装 ${dep}！"
            missing_deps+=("${dep}")
        fi
    done
    # 统一更新+安装缺失的依赖
    if [[ ${#missing_deps[@]} -eq 0 ]]; then
        log_info "✅ 所有依赖库都已安装，无需更新"
        log_info "======================================================================================================================================================\n"
        return 0
    fi
    log_info "🔧 开始自动安装确实依赖库（共${#missing_deps[@]}个）"
    log_info "🔧 尝试更新软件源(sudo apt update)..."
    if ! sudo apt update -y 2>&1; then
        log_error "❌ 升级软件源失败，请检查网络连接或手动执行 sudo apt update"
    fi
    log_info "✅ 软件源更新成功\n"
    for dep in "${missing_deps[@]}"; do 
        log_info "🔧 尝试安装 ${dep}..."
        if sudo apt install -y "${dep}" 2>&1; then
            if command -v "${dep}" &>/dev/null; then
                log_info "✅ ${dep} 安装成功"
            else
                log_error "❌ ${dep} 安装后检测，但未找到，请检查软件源配置"
            fi
        else
            log_error "❌ ${dep} 安装失败，请手动执行 sudo apt install -y ${dep}"
        fi
    done
    log_info "✅ 所有依赖库都已安装"
    log_info "======================================================================================================================================================\n"
}

##################################################
# 函数作用：检查并安装编译工程需要用到的依赖
# 参数说明：无
# 使用说明：内部使用，不用管
##################################################
function check_and_install_deps() {
    # 定义编译工程需要用到的依赖列表
    local REQUIRED_DEPS=(
        "pkg-config"
        "cmake"
    )
    check_and_install_dep "${REQUIRED_DEPS[@]}"
}
